GitConverter/src/InformationRegisters/СостоянияХранилищ/СостоянияХранилищ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияХранилищ</name>
  <resources>
    <name>НомерСеанса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачалоСеанса</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>НачалоОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ЗавершениеОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ВозниклаОшибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекстыОшибок</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Хранилище</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GitConverter/src/InformationRegisters/СостоянияХранилищ/ManagerModule.bsl
Процедура ЗаписатьНачалоОбработки(Знач Хранилище) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Хранилище.Установить(Хранилище);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Хранилище = Хранилище;
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	Сеанс = ПолучитьТекущийСеансИнформационнойБазы();
	
	Запись.НомерСеанса = Сеанс.НомерСеанса;
	Запись.НачалоСеанса = Сеанс.НачалоСеанса;
	Запись.НачалоОбработки = ТекущаяДатаСеанса();
	Запись.ЗавершениеОбработки = Неопределено;
	
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ЗарегистрироватьОшибку(Знач Хранилище, Знач Ошибка) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Хранилище.Установить(Хранилище);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Хранилище = Хранилище;
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	Запись.ВозниклаОшибка = Истина;
	Запись.КоличествоОшибок = Запись.КоличествоОшибок + 1;
	
	Если ТипЗнч(Ошибка) = Тип("ИнформацияОбОшибке") Тогда
		ТекстОшибки = ПодробноеПредставлениеОшибки(Ошибка);
	Иначе
		ТекстОшибки = Строка(Ошибка);
	КонецЕсли;
	Запись.ТекстыОшибок =
		Лев(
			Строка(Запись.КоличествоОшибок)
			+ ". " + Формат(ТекущаяДатаСеанса(), "ДФ='yyyy-MM-dd HH:mm:ss'") + " "
			+ ТекстОшибки
			+ Символы.ПС
			+ Символы.ПС
			+ Запись.ТекстыОшибок,
			25000);
	
	НаборЗаписей.Записать();
КонецПроцедуры

Процедура ЗаписатьУспешноеЗавершениеОбработки(Знач Хранилище) Экспорт
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Хранилище.Установить(Хранилище);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Запись = НаборЗаписей.Добавить();
		Запись.Хранилище = Хранилище;
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;
	
	Запись.ВозниклаОшибка = Ложь;
	Запись.КоличествоОшибок = 0;
	Запись.ТекстыОшибок = "";
	Запись.ЗавершениеОбработки = ТекущаяДатаСеанса();
	
	НаборЗаписей.Записать();
КонецПроцедуры
